# IsValidThickness Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
InsulationLiningBase..::..IsValidThickness Method
InsulationLiningBase Class See Also
---
Identifies if the given thickness value is valid for assignment to insulation or lining elements.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static bool IsValidThickness(
	double thickness
)
```

Visual Basic
---
```text
Public Shared Function IsValidThickness ( _
	thickness As Double _
) As Boolean
```

Visual C++
---
```text
public:
static bool IsValidThickness(
	double thickness
)
```

# ### Parameters
thickness
    Type: System..::..Double Thickness of the insulation and lining elements.
# ### Return Value
True if the thickness is valid, false otherwise.
# See Also
InsulationLiningBase Class
Autodesk.Revit.DB Namespace